src/cf/InformationRegisters/эв_ОчередьОтправкиСтатусовЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>эв_ОчередьОтправкиСтатусовЗаказов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИсточникЗаказов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.эв_ИсточникиЗаказов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусЗаказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОтправки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.эв_ВидыСтатусовОчередиЗаказов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияРезерва</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/эв_ИсторияСтатусовЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>эв_ИсторияСтатусовЗаказов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусЗаказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияРезерва</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/эв_ЛогиHTTPПорталов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>эв_ЛогиHTTPПорталов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Контур</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Метод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодСостояния</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Успех</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДлительностьМс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелоЗапроса</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелоОтвета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникЗаказов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.эв_ИсточникиЗаказов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/эв_НастройкиAPIИсточникаЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>эв_НастройкиAPIИсточникаЗаказов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>auth_token</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>840</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>merchant</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресФТП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛогинФТП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПарольФТП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИсточникЗаказов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.эв_ИсточникиЗаказов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/эв_КодыСтатусовПорталов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>эв_КодыСтатусовПорталов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КодПортала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИсточникЗаказов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.эв_ИсточникиЗаказов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСтатуса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ЗаказыПокупателейССайта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЗаказыПокупателейССайта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерЗаказаНаСайте</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаказаНаСайте</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УзелОбмена</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ИнтеграцияСМагазинамиСоцСетей</v8:Type>
						<v8:Type>cfg:ExchangePlanRef.УдалитьОбменУправлениеНебольшойФирмойСайт</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>эв_ОплаченНаПортале</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>эв_ИсходныйПакет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КлючИнтеграции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиИнтеграцийСИнтернетМагазином</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаИнтеграции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиИнтеграцииСИнтернетМагазином</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/эв_ВыгруженныеОстаткиПорталов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>эв_ВыгруженныеОстаткиПорталов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоступныйОстаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИсточникЗаказов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.эв_ИсточникиЗаказов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/эв_ВидыСтатусовОчередиЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>эв_ВидыСтатусовОчередиЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КПередаче</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/эв_ОбменСПорталамиСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ВыполнитьИнкрементальныйОбмен() Экспорт

	Если Не Константы.эв_ОбменСПорталамиВключен.Получить() Тогда
		Возврат;
	КонецЕсли;

	Источники = АктивныеИсточникиЗаказов();
	Для Каждого Источник Из Источники Цикл

		НастройкиAPI = НастройкиAPIИсточника(Источник);
		ИмяМодуля = ИмяМодуляОбмена(НастройкиAPI);
		Если Не ЗначениеЗаполнено(ИмяМодуля) Тогда
			Продолжить;
		КонецЕсли;

		Попытка
			ВыполнитьЗагрузкуЗаказовИсточника(Источник, НастройкиAPI, ИмяМодуля);
		Исключение
			ЗаписатьОшибкуОбмена(Источник, "Загрузка заказов", ОписаниеОшибки());
		КонецПопытки;

		Попытка
			ВыполнитьВыгрузкуОстатковИсточника(Источник, НастройкиAPI, ИмяМодуля, Ложь);
		Исключение
			ЗаписатьОшибкуОбмена(Источник, "Инкрементальная выгрузка остатков", ОписаниеОшибки());
		КонецПопытки;

	КонецЦикла;

КонецПроцедуры

Процедура ВыполнитьПолнуюВыгрузкуОстатков() Экспорт

	Если Не Константы.эв_ОбменСПорталамиВключен.Получить() Тогда
		Возврат;
	КонецЕсли;

	Источники = АктивныеИсточникиЗаказов();
	Для Каждого Источник Из Источники Цикл

		НастройкиAPI = НастройкиAPIИсточника(Источник);
		ИмяМодуля = ИмяМодуляОбмена(НастройкиAPI);
		Если Не ЗначениеЗаполнено(ИмяМодуля) Тогда
			Продолжить;
		КонецЕсли;

		Попытка
			ВыполнитьВыгрузкуОстатковИсточника(Источник, НастройкиAPI, ИмяМодуля, Истина);
		Исключение
			ЗаписатьОшибкуОбмена(Источник, "Полная выгрузка остатков", ОписаниеОшибки());
		КонецПопытки;

	КонецЦикла;

КонецПроцедуры

Процедура ВыполнитьОбработкуОчередиСтатусов() Экспорт

	Если Не Константы.эв_ОбменСПорталамиВключен.Получить() Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Очередь.ЗаказПокупателя КАК ЗаказПокупателя,
		|	Очередь.ИсточникЗаказов КАК ИсточникЗаказов,
		|	Очередь.СтатусЗаказа КАК СтатусЗаказа,
		|	Очередь.СтатусОтправки КАК СтатусОтправки,
		|	Очередь.КоличествоПопыток КАК КоличествоПопыток,
		|	Очередь.ТекстОшибки КАК ТекстОшибки,
		|	Очередь.Дата КАК Дата,
		|	Очередь.ДатаОкончанияРезерва КАК ДатаОкончанияРезерва
		|ИЗ
		|	РегистрСведений.эв_ОчередьОтправкиСтатусовЗаказов КАК Очередь
		|ГДЕ
		|	Очередь.СтатусОтправки В (ЗНАЧЕНИЕ(Перечисление.эв_ВидыСтатусовОчередиЗаказов.КПередаче), ЗНАЧЕНИЕ(Перечисление.эв_ВидыСтатусовОчередиЗаказов.Ошибка))
		|	И Очередь.КоличествоПопыток < 20";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		НастройкиAPI = НастройкиAPIИсточника(Выборка.ИсточникЗаказов);
		ИмяМодуля = ИмяМодуляОбмена(НастройкиAPI);
		Если Не ЗначениеЗаполнено(ИмяМодуля) Тогда
			Продолжить;
		КонецЕсли;

		ПараметрыОчереди = Новый Структура;
		ПараметрыОчереди.Вставить("ЗаказПокупателя", Выборка.ЗаказПокупателя);
		ПараметрыОчереди.Вставить("ИсточникЗаказов", Выборка.ИсточникЗаказов);
		ПараметрыОчереди.Вставить("СтатусЗаказа", Выборка.СтатусЗаказа);
		ПараметрыОчереди.Вставить("ДатаОкончанияРезерва", Выборка.ДатаОкончанияРезерва);
		ПараметрыОчереди.Вставить("КоличествоПопыток", Выборка.КоличествоПопыток);

		РезультатОтправки = Неопределено;
		Попытка
			РезультатОтправки = ВыполнитьОтправкуСтатусаИсточника(ПараметрыОчереди, НастройкиAPI, ИмяМодуля);
		Исключение
			РезультатОтправки = Новый Структура("Успех, ТекстОшибки", Ложь, ОписаниеОшибки());
		КонецПопытки;

		Если РезультатОтправки = Неопределено Тогда
			РезультатОтправки = Новый Структура("Успех, ТекстОшибки", Ложь, "Модуль обмена не вернул результат");
		КонецЕсли;

		Если РезультатОтправки.Успех Тогда
			УдалитьЗаписьОчередиСтатусов(Выборка.ЗаказПокупателя);
			ЗаписатьИсториюСтатуса(Выборка.ЗаказПокупателя, Выборка.СтатусЗаказа, Выборка.ДатаОкончанияРезерва);
		Иначе
			ОбновитьОшибкуОчередиСтатусов(Выборка.ЗаказПокупателя, Выборка.ИсточникЗаказов,
				Выборка.СтатусЗаказа, Выборка.ДатаОкончанияРезерва, Выборка.КоличествоПопыток + 1,
				РезультатОтправки.ТекстОшибки);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Процедура СнятьПросроченныеРезервы() Экспорт

	Если Не Константы.эв_ОбменСПорталамиВключен.Получить() Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	История.ЗаказПокупателя КАК ЗаказПокупателя,
		|	История.СтатусЗаказа КАК СтатусЗаказа,
		|	История.ДатаОкончанияРезерва КАК ДатаОкончанияРезерва
		|ПОМЕСТИТЬ ВТ_Кандидаты
		|ИЗ
		|	РегистрСведений.эв_ИсторияСтатусовЗаказов.СрезПоследних КАК История
		|ГДЕ
		|	История.ДатаОкончанияРезерва > ДАТАВРЕМЯ(1, 1, 1)
		|	И История.ДатаОкончанияРезерва < &ТекущаяДата
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Очередь.ЗаказПокупателя,
		|	Очередь.СтатусЗаказа,
		|	Очередь.ДатаОкончанияРезерва
		|ИЗ
		|	РегистрСведений.эв_ОчередьОтправкиСтатусовЗаказов КАК Очередь
		|ГДЕ
		|	Очередь.ДатаОкончанияРезерва > ДАТАВРЕМЯ(1, 1, 1)
		|	И Очередь.ДатаОкончанияРезерва < &ТекущаяДата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Кандидаты.ЗаказПокупателя КАК ЗаказПокупателя,
		|	Источники.Ссылка КАК ИсточникЗаказов,
		|	Источники.Вид КАК ВидЗаказа
		|ИЗ
		|	ВТ_Кандидаты КАК ВТ_Кандидаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК Заказы
		|		ПО ВТ_Кандидаты.ЗаказПокупателя = Заказы.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.эв_ИсточникиЗаказов КАК Источники
		|		ПО Заказы.ВидЗаказа = Источники.Вид
		|ГДЕ
		|	Источники.Активный
		|	И НЕ Источники.ПометкаУдаления
		|	И Заказы.Проведен
		|	И Заказы.ВариантЗавершения = ЗНАЧЕНИЕ(Перечисление.ВариантыЗавершенияЗаказа.ПустаяСсылка)";
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		Попытка
			СнятьРезервЗаказа(Выборка.ЗаказПокупателя);
			ТекущееСостояние = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.ЗаказПокупателя, "СостояниеЗаказа");
			ЗаписатьИсториюСтатуса(Выборка.ЗаказПокупателя, ТекущееСостояние, Дата(1, 1, 1));
		Исключение
			ЗаписатьОшибкуОбмена(Выборка.ИсточникЗаказов, "Снятие просроченного резерва", ОписаниеОшибки());
			Продолжить;
		КонецПопытки;

		СтатусОтмены = СостояниеОтменыЗаказа(Выборка.ВидЗаказа);
		Если ЗначениеЗаполнено(СтатусОтмены) Тогда
			ПоставитьЗаказВОчередьСтатусов(Выборка.ЗаказПокупателя, Выборка.ИсточникЗаказов, СтатусОтмены, Дата(1, 1, 1), Ложь);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Функция ВыполнитьЗапросHTTP(ПараметрыЗапроса) Экспорт

	Результат = НовыйРезультатHTTP();
	Если ТипЗнч(ПараметрыЗапроса) <> Тип("Структура") Тогда
		Результат.ТекстОшибки = "Не заданы параметры HTTP-запроса";
		Возврат Результат;
	КонецЕсли;

	Метод = ВРег(СокрЛП(ЗначениеСвойства(ПараметрыЗапроса, "Метод", "GET")));
	Адрес = СокрЛП(ЗначениеСвойства(ПараметрыЗапроса, "Адрес", ""));
	Если Не ЗначениеЗаполнено(Адрес) Тогда
		Результат.ТекстОшибки = "Не задан адрес HTTP-запроса";
		Возврат Результат;
	КонецЕсли;

	ДополнительныеПараметры = КоннекторHTTP.НовыеПараметры();
	Заголовки = ЗначениеСвойства(ПараметрыЗапроса, "Заголовки", Неопределено);
	Если ТипЗнч(Заголовки) = Тип("Соответствие") Тогда
		ДополнительныеПараметры.Заголовки = Заголовки;
	КонецЕсли;

	ПараметрыURL = ЗначениеСвойства(ПараметрыЗапроса, "ПараметрыURL", Неопределено);
	Если ПараметрыURL <> Неопределено Тогда
		ДополнительныеПараметры.ПараметрыЗапроса = ПараметрыURL;
	КонецЕсли;

	Тело = ЗначениеСвойства(ПараметрыЗапроса, "Тело", Неопределено);
	Если Тело <> Неопределено Тогда
		ДополнительныеПараметры.Json = Тело;
		Если ДополнительныеПараметры.Заголовки.Получить("Content-Type") = Неопределено Тогда
			ДополнительныеПараметры.Заголовки.Вставить("Content-Type", "application/json");
		КонецЕсли;
	КонецЕсли;

	НачалоЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ОтветHTTP = Неопределено;
	Попытка
		ОтветHTTP = КоннекторHTTP.ВызватьМетод(Метод, Адрес, ДополнительныеПараметры);
	Исключение
		Результат.ДлительностьМс = ТекущаяУниверсальнаяДатаВМиллисекундах() - НачалоЗамера;
		Результат.ТекстОшибки = ОписаниеОшибки();
		ЗаписатьЛогHTTP(ПараметрыЗапроса, Результат, Тело);
		Возврат Результат;
	КонецПопытки;

	Результат.ДлительностьМс = ТекущаяУниверсальнаяДатаВМиллисекундах() - НачалоЗамера;
	Если ОтветHTTP = Неопределено Тогда
		Результат.ТекстОшибки = "Пустой ответ HTTP";
		ЗаписатьЛогHTTP(ПараметрыЗапроса, Результат, Тело);
		Возврат Результат;
	КонецЕсли;

	Результат.КодСостояния = ОтветHTTP.КодСостояния;
	Результат.АдресФакт = ОтветHTTP.URL;
	Попытка
		Результат.ТекстОтвета = КоннекторHTTP.КакТекст(ОтветHTTP);
	Исключение
		Результат.ТекстОтвета = "";
	КонецПопытки;

	Если ЗначениеЗаполнено(Результат.ТекстОтвета) Тогда
		Попытка
			Результат.Json = КоннекторHTTP.КакJson(ОтветHTTP);
		Исключение
			Результат.Json = Неопределено;
		КонецПопытки;
	КонецЕсли;

	Результат.Успех = (Результат.КодСостояния = 200);
	Если Не Результат.Успех Тогда
		Результат.ТекстОшибки = СтрШаблон("HTTP %1. %2", Формат(Результат.КодСостояния, "ЧГ="), Лев(Результат.ТекстОтвета, 1000));
	КонецЕсли;

	ЗаписатьЛогHTTP(ПараметрыЗапроса, Результат, Тело);
	Возврат Результат;

КонецФункции

Процедура ОчиститьЛогиHTTP(СтаршеДней = 0) Экспорт

	КоличествоДней = СтаршеДней;
	Если КоличествоДней <= 0 Тогда
		КоличествоДней = 30;
	КонецЕсли;

	Граница = ТекущаяДатаСеанса() - КоличествоДней * 86400;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Логи.Период КАК Период,
		|	Логи.Идентификатор КАК Идентификатор,
		|	Логи.ИсточникЗаказов КАК ИсточникЗаказов
		|ИЗ
		|	РегистрСведений.эв_ЛогиHTTPПорталов КАК Логи
		|ГДЕ
		|	Логи.Период < &Граница";
	Запрос.УстановитьПараметр("Граница", Граница);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Набор = РегистрыСведений.эв_ЛогиHTTPПорталов.СоздатьНаборЗаписей();
		Набор.Отбор.Период.Установить(Выборка.Период);
		Набор.Отбор.Идентификатор.Установить(Выборка.Идентификатор);
		Набор.Отбор.ИсточникЗаказов.Установить(Выборка.ИсточникЗаказов);
		Набор.Записать();
	КонецЦикла;

КонецПроцедуры

Функция НастройкиAPIИсточника(Источник) Экспорт

	Настройки = Новый Структура;
	Настройки.Вставить("Адрес", "");
	Настройки.Вставить("auth_token", "");
	Настройки.Вставить("merchant", "");
	Настройки.Вставить("Логин", "");
	Настройки.Вставить("Пароль", "");
	Настройки.Вставить("АдресФТП", "");
	Настройки.Вставить("ЛогинФТП", "");
	Настройки.Вставить("ПарольФТП", "");
	Настройки.Вставить("Склад", Неопределено);
	Настройки.Вставить("ВидЦен", Неопределено);
	Настройки.Вставить("Вид", Неопределено);
	Настройки.Вставить("СрокХраненияРезерва", 0);
	Настройки.Вставить("ИсточникЗаказов", Источник);

	Если Не ЗначениеЗаполнено(Источник) Тогда
		Возврат Настройки;
	КонецЕсли;

	РеквизитыИсточника = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, "Склад, ВидЦен, Вид, СрокХраненияРезерва");
	ЗаполнитьЗначенияСвойств(Настройки, РеквизитыИсточника);

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Настройки.Адрес КАК Адрес,
		|	Настройки.auth_token КАК auth_token,
		|	Настройки.merchant КАК merchant,
		|	Настройки.Логин КАК Логин,
		|	Настройки.Пароль КАК Пароль,
		|	Настройки.АдресФТП КАК АдресФТП,
		|	Настройки.ЛогинФТП КАК ЛогинФТП,
		|	Настройки.ПарольФТП КАК ПарольФТП
		|ИЗ
		|	РегистрСведений.эв_НастройкиAPIИсточникаЗаказов КАК Настройки
		|ГДЕ
		|	Настройки.ИсточникЗаказов = &ИсточникЗаказов";
	Запрос.УстановитьПараметр("ИсточникЗаказов", Источник);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Настройки, Выборка);
	КонецЕсли;

	Возврат Настройки;

КонецФункции

Функция БазовыйАдресAPI(НастройкиAPI) Экспорт

	Адрес = СокрЛП(НастройкиAPI.Адрес);
	Пока СтрЗаканчиваетсяНа(Адрес, "/") Цикл
		Адрес = Лев(Адрес, СтрДлина(Адрес) - 1);
	КонецЦикла;

	Если СтрНачинаетсяС(НРег(Адрес), "http://") Или СтрНачинаетсяС(НРег(Адрес), "https://") Тогда
		Возврат Адрес;
	КонецЕсли;

	Возврат "https://" + Адрес;

КонецФункции

Функция КодСтатусаПортала(Источник, ВидСтатуса) Экспорт

	Если Не ЗначениеЗаполнено(Источник) Или Не ЗначениеЗаполнено(ВидСтатуса) Тогда
		Возврат "";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Коды.КодПортала КАК КодПортала
		|ИЗ
		|	РегистрСведений.эв_КодыСтатусовПорталов КАК Коды
		|ГДЕ
		|	Коды.ИсточникЗаказов = &ИсточникЗаказов
		|	И Коды.ВидСтатуса = &ВидСтатуса
		|	И Коды.Используется";
	Запрос.УстановитьПараметр("ИсточникЗаказов", Источник);
	Запрос.УстановитьПараметр("ВидСтатуса", ВидСтатуса);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат СокрЛП(Выборка.КодПортала);
	КонецЕсли;

	Возврат "";

КонецФункции

Функция СостояниеНовыйЗаказа(ВидЗаказа) Экспорт

	Если Не ЗначениеЗаполнено(ВидЗаказа) Тогда
		Возврат Справочники.СостоянияЗаказовПокупателей.ПустаяСсылка();
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПорядокСостояний.Состояние КАК Состояние
		|ИЗ
		|	Справочник.ВидыЗаказовПокупателей.ПорядокСостояний КАК ПорядокСостояний
		|ГДЕ
		|	ПорядокСостояний.Ссылка = &ВидЗаказа
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПорядокСостояний.НомерСтроки";
	Запрос.УстановитьПараметр("ВидЗаказа", ВидЗаказа);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Состояние;
	КонецЕсли;

	Возврат Справочники.СостоянияЗаказовПокупателей.ПустаяСсылка();

КонецФункции

Функция НайтиЗаказПоНомеруНаСайте(НомерЗаказаНаСайте, Источник) Экспорт

	Если Не ЗначениеЗаполнено(НомерЗаказаНаСайте) Тогда
		Возврат Документы.ЗаказПокупателя.ПустаяСсылка();
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказыСайта.ЗаказПокупателя КАК ЗаказПокупателя
		|ИЗ
		|	РегистрСведений.ЗаказыПокупателейССайта КАК ЗаказыСайта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК Заказы
		|		ПО ЗаказыСайта.ЗаказПокупателя = Заказы.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.эв_ИсточникиЗаказов КАК Источники
		|		ПО Заказы.ВидЗаказа = Источники.Вид
		|ГДЕ
		|	ЗаказыСайта.НомерЗаказаНаСайте = &НомерЗаказаНаСайте
		|	И (Источники.Ссылка = &Источник
		|			ИЛИ Заказы.ВидЗаказа = &ВидЗаказа)";
	Запрос.УстановитьПараметр("НомерЗаказаНаСайте", СокрЛП(НомерЗаказаНаСайте));
	Запрос.УстановитьПараметр("Источник", Источник);
	Запрос.УстановитьПараметр("ВидЗаказа", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник, "Вид"));

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЗаказПокупателя;
	КонецЕсли;

	Возврат Документы.ЗаказПокупателя.ПустаяСсылка();

КонецФункции

Функция НомерЗаказаНаСайте(ЗаказПокупателя) Экспорт

	Если Не ЗначениеЗаполнено(ЗаказПокупателя) Тогда
		Возврат "";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказыСайта.НомерЗаказаНаСайте КАК НомерЗаказаНаСайте
		|ИЗ
		|	РегистрСведений.ЗаказыПокупателейССайта КАК ЗаказыСайта
		|ГДЕ
		|	ЗаказыСайта.ЗаказПокупателя = &ЗаказПокупателя";
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат СокрЛП(Выборка.НомерЗаказаНаСайте);
	КонецЕсли;

	Возврат "";

КонецФункции

Функция СоздатьЗаказПортала(Источник, НастройкиAPI, ДанныеЗаказа) Экспорт

	ДокументОбъект = Документы.ЗаказПокупателя.СоздатьДокумент();
	ДокументОбъект.Дата = ?(ЗначениеЗаполнено(ДанныеЗаказа.Дата), ДанныеЗаказа.Дата, ТекущаяДатаСеанса());
	ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу;
	ДокументОбъект.ВидЗаказа = НастройкиAPI.Вид;
	ДокументОбъект.СостояниеЗаказа = СостояниеНовыйЗаказа(НастройкиAPI.Вид);
	ДокументОбъект.Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкиAPI.Склад, "Организация");
	ДокументОбъект.СтруктурнаяЕдиницаРезерв = НастройкиAPI.Склад;
	ДокументОбъект.ВидЦен = НастройкиAPI.ВидЦен;
	ДокументОбъект.ВалютаДокумента = Константы.НациональнаяВалюта.Получить();
	ДокументОбъект.Курс = 1;
	ДокументОбъект.Кратность = 1;
	ДокументОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
	ДокументОбъект.СуммаВключаетНДС = Истина;
	ДокументОбъект.Комментарий = ДанныеЗаказа.Комментарий;
	ДокументОбъект.Телефон = ДанныеЗаказа.Телефон;
	ДокументОбъект.АдресЭП = ДанныеЗаказа.Почта;

	ДокументОбъект.Контрагент = НайтиИлиСоздатьКонтрагентаПортала(ДанныеЗаказа);
	Если ЗначениеЗаполнено(ДокументОбъект.Контрагент) Тогда
		ДокументОбъект.Договор = Справочники.ДоговорыКонтрагентов.ДоговорПоУмолчанию(ДокументОбъект.Контрагент);
	КонецЕсли;

	Для Каждого СтрокаТовара Из ДанныеЗаказа.Товары Цикл

		Если Не ЗначениеЗаполнено(СтрокаТовара.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;

		СтрокаЗапасы = ДокументОбъект.Запасы.Добавить();
		СтрокаЗапасы.Номенклатура = СтрокаТовара.Номенклатура;
		СтрокаЗапасы.Характеристика = СтрокаТовара.Характеристика;
		СтрокаЗапасы.Количество = СтрокаТовара.Количество;
		СтрокаЗапасы.Цена = СтрокаТовара.Цена;
		СтрокаЗапасы.Сумма = СтрокаЗапасы.Количество * СтрокаЗапасы.Цена;
		СтрокаЗапасы.ЕдиницаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.Номенклатура, "ЕдиницаИзмерения");
		СтрокаЗапасы.СтруктурнаяЕдиницаРезерв = НастройкиAPI.Склад;
		СтрокаЗапасы.Резерв = СтрокаЗапасы.Количество;
		СтрокаЗапасы.эв_ИдентификаторПозицииПортала = СтрокаТовара.ИдПозиции;

		ВидСтавкиНДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовара.Номенклатура, "ВидСтавкиНДС");
		СтрокаЗапасы.СтавкаНДС = Справочники.СтавкиНДС.СтавкаНДС(ВидСтавкиНДС, ДокументОбъект.Дата);
		ЗаполнитьСуммыНДССтроки(СтрокаЗапасы, ДокументОбъект.СуммаВключаетНДС);

	КонецЦикла;

	ДокументОбъект.СуммаДокумента = ДокументОбъект.Запасы.Итог("Всего");
	Если ДокументОбъект.СуммаДокумента = 0 Тогда
		ДокументОбъект.СуммаДокумента = ДокументОбъект.Запасы.Итог("Сумма");
	КонецЕсли;

	ДокументОбъект.ОбменДанными.Загрузка = Истина;
	ДокументОбъект.Записать();

	ЗаписатьЗаказПокупателяССайта(ДокументОбъект.Ссылка, ДанныеЗаказа);

	ДокументОбъект.ОбменДанными.Загрузка = Ложь;
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ЗаписатьОшибкуОбмена(Источник, "Проведение заказа " + ДанныеЗаказа.НомерНаСайте, ОписаниеОшибки());
	КонецПопытки;

	Возврат ДокументОбъект.Ссылка;

КонецФункции

Процедура ПоставитьЗаказВОчередьСтатусов(ЗаказПокупателя, Источник, СтатусЗаказа, ДатаОкончанияРезерва = Неопределено, ПроверятьОчередность = Истина) Экспорт

	Если Не ЗначениеЗаполнено(ЗаказПокупателя) Или Не ЗначениеЗаполнено(СтатусЗаказа) Тогда
		Возврат;
	КонецЕсли;

	Если ПроверятьОчередность И Не ОчередностьСтатусовКорректна(ЗаказПокупателя, Источник, СтатусЗаказа) Тогда
		Возврат;
	КонецЕсли;

	ДатаРезерва = ДатаОкончанияРезерва;
	Если ДатаРезерва = Неопределено Тогда
		ДатаРезерва = ДатаОкончанияРезерваИсточника(Источник);
	КонецЕсли;

	МенеджерЗаписи = РегистрыСведений.эв_ОчередьОтправкиСтатусовЗаказов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ЗаказПокупателя = ЗаказПокупателя;
	МенеджерЗаписи.ИсточникЗаказов = Источник;
	МенеджерЗаписи.СтатусЗаказа = СтатусЗаказа;
	МенеджерЗаписи.СтатусОтправки = Перечисления.эв_ВидыСтатусовОчередиЗаказов.КПередаче;
	МенеджерЗаписи.КоличествоПопыток = 0;
	МенеджерЗаписи.ТекстОшибки = "";
	МенеджерЗаписи.Дата = ТекущаяДатаСеанса();
	МенеджерЗаписи.ДатаОкончанияРезерва = ДатаРезерва;
	МенеджерЗаписи.Записать();

КонецПроцедуры

Процедура ОбновитьСнимокОстатков(Источник, ТаблицаОстатков, ПолнаяВыгрузка) Экспорт

	ДатаОбновления = ТекущаяДатаСеанса();

	Если ПолнаяВыгрузка Тогда
		Набор = РегистрыСведений.эв_ВыгруженныеОстаткиПорталов.СоздатьНаборЗаписей();
		Набор.Отбор.ИсточникЗаказов.Установить(Источник);
		Набор.Записать();
	КонецЕсли;

	Для Каждого СтрокаОстатка Из ТаблицаОстатков Цикл

		МенеджерЗаписи = РегистрыСведений.эв_ВыгруженныеОстаткиПорталов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИсточникЗаказов = Источник;
		МенеджерЗаписи.Номенклатура = СтрокаОстатка.Номенклатура;
		МенеджерЗаписи.Характеристика = СтрокаОстатка.Характеристика;

		Если СтрокаОстатка.ДоступныйОстаток <= 0 Тогда
			МенеджерЗаписи.Удалить();
			Продолжить;
		КонецЕсли;

		МенеджерЗаписи.Цена = СтрокаОстатка.Цена;
		МенеджерЗаписи.ДоступныйОстаток = СтрокаОстатка.ДоступныйОстаток;
		МенеджерЗаписи.ДатаОбновления = ДатаОбновления;
		МенеджерЗаписи.Записать();

	КонецЦикла;

КонецПроцедуры

Функция ДатаГраницыЗагрузкиЗаказов(Источник, Контур = "getOrders") Экспорт

	МинимальнаяДата = Дата(2025, 9, 1);

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	МАКСИМУМ(Логи.Период) КАК Период
		|ИЗ
		|	РегистрСведений.эв_ЛогиHTTPПорталов КАК Логи
		|ГДЕ
		|	Логи.ИсточникЗаказов = &ИсточникЗаказов
		|	И Логи.Контур = &Контур
		|	И Логи.Успех";
	Запрос.УстановитьПараметр("ИсточникЗаказов", Источник);
	Запрос.УстановитьПараметр("Контур", Контур);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Период) Тогда
		Возврат Макс(Выборка.Период, МинимальнаяДата);
	КонецЕсли;

	Возврат МинимальнаяДата;

КонецФункции

Функция ДатаISOСмещением(ДатаЗначение) Экспорт

	ЛокальнаяДата = ДатаЗначение;
	УниверсальнаяДата = УниверсальноеВремя(ЛокальнаяДата);
	СмещениеСекунд = ЛокальнаяДата - УниверсальнаяДата;
	ЗнакСмещения = ?(СмещениеСекунд >= 0, "+", "-");
	АбсСмещение = Макс(СмещениеСекунд, -СмещениеСекунд);
	ЧасыСмещения = Цел(АбсСмещение / 3600);
	МинутыСмещения = Цел((АбсСмещение - ЧасыСмещения * 3600) / 60);

	Возврат Формат(ЛокальнаяДата, "ДФ=yyyy-MM-ddTHH:mm:ss")
		+ ЗнакСмещения
		+ Формат(ЧасыСмещения, "ЧЦ=2; ЧВН=; ЧН=00; ЧГ=")
		+ ":"
		+ Формат(МинутыСмещения, "ЧЦ=2; ЧВН=; ЧН=00; ЧГ=");

КонецФункции

Функция НоменклатураПоИдентификаторуПортала(ИдПозиции) Экспорт

	Если Не ЗначениеЗаполнено(ИдПозиции) Тогда
		Возврат Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;

	СтрокаИд = СокрЛП(Строка(ИдПозиции));
	Попытка
		УникальныйИд = Новый УникальныйИдентификатор(СтрокаИд);
		СсылкаНоменклатуры = Справочники.Номенклатура.ПолучитьСсылку(УникальныйИд);
		Если ОбщегоНазначения.СсылкаСуществует(СсылкаНоменклатуры) Тогда
			Возврат СсылкаНоменклатуры;
		КонецЕсли;
	Исключение
		Возврат Справочники.Номенклатура.ПустаяСсылка();
	КонецПопытки;

	Возврат Справочники.Номенклатура.ПустаяСсылка();

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция АктивныеИсточникиЗаказов()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Источники.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.эв_ИсточникиЗаказов КАК Источники
		|ГДЕ
		|	Источники.Активный
		|	И НЕ Источники.ПометкаУдаления";

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции

Функция ИмяМодуляОбмена(НастройкиAPI)

	Если эв_ОбменСПорталамиАптекаМос.ДанныеПодключенияКорректны(НастройкиAPI) Тогда
		Возврат "АптекаМос";
	КонецЕсли;
	Если эв_ОбменСПорталамиМегааптека.ДанныеПодключенияКорректны(НастройкиAPI) Тогда
		Возврат "Мегааптека";
	КонецЕсли;
	Если эв_ОбменСПорталамиЮтека.ДанныеПодключенияКорректны(НастройкиAPI) Тогда
		Возврат "Ютека";
	КонецЕсли;
	Если эв_ОбменСПорталамиАсна.ДанныеПодключенияКорректны(НастройкиAPI) Тогда
		Возврат "Асна";
	КонецЕсли;
	Если эв_ОбменСПорталамиЭвалар.ДанныеПодключенияКорректны(НастройкиAPI) Тогда
		Возврат "Эвалар";
	КонецЕсли;

	Возврат "";

КонецФункции

Процедура ВыполнитьЗагрузкуЗаказовИсточника(Источник, НастройкиAPI, ИмяМодуля)

	Если ИмяМодуля = "АптекаМос" Тогда
		эв_ОбменСПорталамиАптекаМос.ЗагрузитьЗаказы(Источник, НастройкиAPI);
	ИначеЕсли ИмяМодуля = "Мегааптека" Тогда
		эв_ОбменСПорталамиМегааптека.ЗагрузитьЗаказы(Источник, НастройкиAPI);
	ИначеЕсли ИмяМодуля = "Ютека" Тогда
		эв_ОбменСПорталамиЮтека.ЗагрузитьЗаказы(Источник, НастройкиAPI);
	ИначеЕсли ИмяМодуля = "Асна" Тогда
		эв_ОбменСПорталамиАсна.ЗагрузитьЗаказы(Источник, НастройкиAPI);
	ИначеЕсли ИмяМодуля = "Эвалар" Тогда
		эв_ОбменСПорталамиЭвалар.ЗагрузитьЗаказы(Источник, НастройкиAPI);
	КонецЕсли;

КонецПроцедуры

Процедура ВыполнитьВыгрузкуОстатковИсточника(Источник, НастройкиAPI, ИмяМодуля, ПолнаяВыгрузка)

	Если ИмяМодуля = "АптекаМос" Тогда
		эв_ОбменСПорталамиАптекаМос.ВыгрузитьОстатки(Источник, НастройкиAPI, ПолнаяВыгрузка);
	ИначеЕсли ИмяМодуля = "Мегааптека" Тогда
		эв_ОбменСПорталамиМегааптека.ВыгрузитьОстатки(Источник, НастройкиAPI, ПолнаяВыгрузка);
	ИначеЕсли ИмяМодуля = "Ютека" Тогда
		эв_ОбменСПорталамиЮтека.ВыгрузитьОстатки(Источник, НастройкиAPI, ПолнаяВыгрузка);
	ИначеЕсли ИмяМодуля = "Асна" Тогда
		эв_ОбменСПорталамиАсна.ВыгрузитьОстатки(Источник, НастройкиAPI, ПолнаяВыгрузка);
	ИначеЕсли ИмяМодуля = "Эвалар" Тогда
		эв_ОбменСПорталамиЭвалар.ВыгрузитьОстатки(Источник, НастройкиAPI, ПолнаяВыгрузка);
	КонецЕсли;

КонецПроцедуры

Функция ВыполнитьОтправкуСтатусаИсточника(ПараметрыОчереди, НастройкиAPI, ИмяМодуля)

	Если ИмяМодуля = "АптекаМос" Тогда
		Возврат эв_ОбменСПорталамиАптекаМос.ОтправитьСтатус(ПараметрыОчереди, НастройкиAPI);
	ИначеЕсли ИмяМодуля = "Мегааптека" Тогда
		Возврат эв_ОбменСПорталамиМегааптека.ОтправитьСтатус(ПараметрыОчереди, НастройкиAPI);
	ИначеЕсли ИмяМодуля = "Ютека" Тогда
		Возврат эв_ОбменСПорталамиЮтека.ОтправитьСтатус(ПараметрыОчереди, НастройкиAPI);
	ИначеЕсли ИмяМодуля = "Асна" Тогда
		Возврат эв_ОбменСПорталамиАсна.ОтправитьСтатус(ПараметрыОчереди, НастройкиAPI);
	ИначеЕсли ИмяМодуля = "Эвалар" Тогда
		Возврат эв_ОбменСПорталамиЭвалар.ОтправитьСтатус(ПараметрыОчереди, НастройкиAPI);
	КонецЕсли;

	Возврат Новый Структура("Успех, ТекстОшибки", Ложь, "Не найден модуль обмена");

КонецФункции

Функция НовыйРезультатHTTP()

	Результат = Новый Структура;
	Результат.Вставить("Успех", Ложь);
	Результат.Вставить("КодСостояния", 0);
	Результат.Вставить("Json", Неопределено);
	Результат.Вставить("ТекстОтвета", "");
	Результат.Вставить("ТекстОшибки", "");
	Результат.Вставить("ДлительностьМс", 0);
	Результат.Вставить("АдресФакт", "");
	Возврат Результат;

КонецФункции

Процедура ЗаписатьЛогHTTP(ПараметрыЗапроса, Результат, Тело)

	Источник = ЗначениеСвойства(ПараметрыЗапроса, "ИсточникЗаказов", Справочники.эв_ИсточникиЗаказов.ПустаяСсылка());
	ЗаказПокупателя = ЗначениеСвойства(ПараметрыЗапроса, "ЗаказПокупателя", Документы.ЗаказПокупателя.ПустаяСсылка());

	АдресДляЛога = ЗначениеСвойства(Результат, "АдресФакт", "");
	Если Не ЗначениеЗаполнено(АдресДляЛога) Тогда
		АдресДляЛога = ЗначениеСвойства(ПараметрыЗапроса, "Адрес", "");
	КонецЕсли;
	АдресДляЛога = МаскироватьСекретыВАдресе(АдресДляЛога, ПараметрыЗапроса);

	ТекстЗапроса = "";
	Если Тело <> Неопределено Тогда
		Попытка
			ТекстЗапроса = МаскироватьСекретыВТеле(КоннекторHTTP.ОбъектВJson(Тело), ПараметрыЗапроса);
		Исключение
			ТекстЗапроса = Строка(Тело);
		КонецПопытки;
	КонецЕсли;

	МенеджерЗаписи = РегистрыСведений.эв_ЛогиHTTPПорталов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	МенеджерЗаписи.Идентификатор = Новый УникальныйИдентификатор;
	МенеджерЗаписи.ИсточникЗаказов = Источник;
	МенеджерЗаписи.Контур = Лев(ЗначениеСвойства(ПараметрыЗапроса, "Контур", ""), 20);
	МенеджерЗаписи.Метод = Лев(ВРег(ЗначениеСвойства(ПараметрыЗапроса, "Метод", "")), 10);
	МенеджерЗаписи.Адрес = Лев(АдресДляЛога, 500);
	МенеджерЗаписи.КодСостояния = Результат.КодСостояния;
	МенеджерЗаписи.ЗаказПокупателя = ЗаказПокупателя;
	МенеджерЗаписи.Успех = Результат.Успех;
	МенеджерЗаписи.ДлительностьМс = Результат.ДлительностьМс;
	МенеджерЗаписи.ТекстОшибки = Результат.ТекстОшибки;
	МенеджерЗаписи.ТелоЗапроса = Новый ХранилищеЗначения(ТекстЗапроса, Новый СжатиеДанных(9));
	МенеджерЗаписи.ТелоОтвета = Новый ХранилищеЗначения(Результат.ТекстОтвета, Новый СжатиеДанных(9));
	МенеджерЗаписи.Записать();

КонецПроцедуры

Функция МаскироватьСекретыВАдресе(Адрес, ПараметрыЗапроса)

	РезультатАдрес = Адрес;
	Пароль = ЗначениеСвойства(ПараметрыЗапроса, "ПарольДляМаскировки", "");
	Если ЗначениеЗаполнено(Пароль) Тогда
		РезультатАдрес = СтрЗаменить(РезультатАдрес, Пароль, "***");
		Попытка
			РезультатАдрес = СтрЗаменить(РезультатАдрес, КодироватьСтроку(Пароль, СпособКодированияСтроки.КодировкаURL), "***");
		Исключение
		КонецПопытки;
	КонецЕсли;
	Возврат РезультатАдрес;

КонецФункции

Функция МаскироватьСекретыВТеле(Текст, ПараметрыЗапроса)

	РезультатТекст = Текст;
	Пароль = ЗначениеСвойства(ПараметрыЗапроса, "ПарольДляМаскировки", "");
	Если ЗначениеЗаполнено(Пароль) Тогда
		РезультатТекст = СтрЗаменить(РезультатТекст, Пароль, "***");
	КонецЕсли;
	ПарольФТП = ЗначениеСвойства(ПараметрыЗапроса, "ПарольФТПДляМаскировки", "");
	Если ЗначениеЗаполнено(ПарольФТП) Тогда
		РезультатТекст = СтрЗаменить(РезультатТекст, ПарольФТП, "***");
	КонецЕсли;
	Возврат РезультатТекст;

КонецФункции

Процедура ЗаписатьЗаказПокупателяССайта(ЗаказПокупателя, ДанныеЗаказа)

	МенеджерЗаписи = РегистрыСведений.ЗаказыПокупателейССайта.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ЗаказПокупателя = ЗаказПокупателя;
	МенеджерЗаписи.НомерЗаказаНаСайте = ДанныеЗаказа.НомерНаСайте;
	МенеджерЗаписи.ДатаЗаказаНаСайте = ДанныеЗаказа.Дата;
	МенеджерЗаписи.эв_ОплаченНаПортале = Ложь;
	МенеджерЗаписи.эв_ИсходныйПакет = Новый ХранилищеЗначения(ДанныеЗаказа.ИсходныйПакетJSON, Новый СжатиеДанных(9));
	МенеджерЗаписи.Записать();

КонецПроцедуры

Функция НайтиИлиСоздатьКонтрагентаПортала(ДанныеЗаказа)

	Контрагент = Неопределено;
	Если ЗначениеЗаполнено(ДанныеЗаказа.Телефон) Тогда
		Контрагент = КонтактнаяИнформацияУНФ.КонтрагентПоНомеруТелефона(ДанныеЗаказа.Телефон, Истина, Ложь, Ложь);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Контрагент) И ЗначениеЗаполнено(ДанныеЗаказа.Почта) Тогда
		Контрагент = КонтактнаяИнформацияУНФ.КонтрагентПоАдресуЭП(ДанныеЗаказа.Почта, Истина, Ложь);
	КонецЕсли;
	Если ТипЗнч(Контрагент) = Тип("СправочникСсылка.Контрагенты") И ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Контрагент;
	КонецЕсли;

	ФИО = СокрЛП(СтрШаблон("%1 %2 %3", ДанныеЗаказа.Фамилия, ДанныеЗаказа.Имя, ДанныеЗаказа.Отчество));
	Если Не ЗначениеЗаполнено(ФИО) Тогда
		ФИО = "Покупатель портала";
	КонецЕсли;

	КонтрагентОбъект = Справочники.Контрагенты.СоздатьЭлемент();
	КонтрагентОбъект.Наименование = ФИО;
	КонтрагентОбъект.НаименованиеПолное = ФИО;
	КонтрагентОбъект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо;
	КонтрагентОбъект.Покупатель = Истина;
	КонтрагентОбъект.ВестиРасчетыПоДоговорам = Истина;
	КонтрагентОбъект.ВестиРасчетыПоДокументам = Истина;
	КонтрагентОбъект.ВестиРасчетыПоЗаказам = Истина;
	КонтрагентОбъект.ВестиУчетОплатыПоСчетам = Истина;
	КонтрагентОбъект.СчетУчетаРасчетовСПокупателем = ПланыСчетов.Управленческий.РасчетыСПокупателями;
	КонтрагентОбъект.СчетУчетаАвансовПокупателя = ПланыСчетов.Управленческий.РасчетыПоАвансамПолученным;
	КонтрагентОбъект.СчетУчетаРасчетовСПоставщиком = ПланыСчетов.Управленческий.РасчетыСПоставщиками;
	КонтрагентОбъект.СчетУчетаАвансовПоставщику = ПланыСчетов.Управленческий.РасчетыПоАвансамВыданным;

	Если ЗначениеЗаполнено(ДанныеЗаказа.Телефон) Тогда
		УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(КонтрагентОбъект, ДанныеЗаказа.Телефон,
			Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеЗаказа.Почта) Тогда
		УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(КонтрагентОбъект, ДанныеЗаказа.Почта,
			Справочники.ВидыКонтактнойИнформации.EmailКонтрагента);
	КонецЕсли;

	КонтрагентОбъект.Записать();
	Возврат КонтрагентОбъект.Ссылка;

КонецФункции

Процедура ЗаполнитьСуммыНДССтроки(СтрокаЗапасы, СуммаВключаетНДС)

	СтавкаЧисло = 0;
	Если ЗначениеЗаполнено(СтрокаЗапасы.СтавкаНДС) Тогда
		СтавкаЧисло = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаЗапасы.СтавкаНДС, "Ставка");
		Если СтавкаЧисло = Неопределено Тогда
			СтавкаЧисло = 0;
		КонецЕсли;
	КонецЕсли;

	Если СуммаВключаетНДС Тогда
		СтрокаЗапасы.СуммаНДС = СтрокаЗапасы.Сумма - СтрокаЗапасы.Сумма * 100 / (100 + СтавкаЧисло);
		СтрокаЗапасы.Всего = СтрокаЗапасы.Сумма;
	Иначе
		СтрокаЗапасы.СуммаНДС = СтрокаЗапасы.Сумма * СтавкаЧисло / 100;
		СтрокаЗапасы.Всего = СтрокаЗапасы.Сумма + СтрокаЗапасы.СуммаНДС;
	КонецЕсли;

КонецПроцедуры

Функция ОчередностьСтатусовКорректна(ЗаказПокупателя, Источник, НовыйСтатус)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	История.СтатусЗаказа КАК СтатусЗаказа
		|ИЗ
		|	РегистрСведений.эв_ИсторияСтатусовЗаказов.СрезПоследних(, ЗаказПокупателя = &ЗаказПокупателя) КАК История";
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Или Не ЗначениеЗаполнено(Выборка.СтатусЗаказа) Тогда
		Возврат Истина;
	КонецЕсли;

	ТекущийСтатус = Выборка.СтатусЗаказа;
	Если ТекущийСтатус = НовыйСтатус Тогда
		Возврат Ложь;
	КонецЕсли;

	ВидЗаказа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник, "Вид");
	ПорядокТекущего = НомерСостоянияВВидеЗаказа(ВидЗаказа, ТекущийСтатус);
	ПорядокНового = НомерСостоянияВВидеЗаказа(ВидЗаказа, НовыйСтатус);
	Если ПорядокТекущего = 0 Или ПорядокНового = 0 Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат ПорядокНового >= ПорядокТекущего;

КонецФункции

Функция НомерСостоянияВВидеЗаказа(ВидЗаказа, Состояние)

	Если Не ЗначениеЗаполнено(ВидЗаказа) Или Не ЗначениеЗаполнено(Состояние) Тогда
		Возврат 0;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПорядокСостояний.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Справочник.ВидыЗаказовПокупателей.ПорядокСостояний КАК ПорядокСостояний
		|ГДЕ
		|	ПорядокСостояний.Ссылка = &ВидЗаказа
		|	И ПорядокСостояний.Состояние = &Состояние";
	Запрос.УстановитьПараметр("ВидЗаказа", ВидЗаказа);
	Запрос.УстановитьПараметр("Состояние", Состояние);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НомерСтроки;
	КонецЕсли;

	Возврат 0;

КонецФункции

Функция СостояниеОтменыЗаказа(ВидЗаказа)

	Если Не ЗначениеЗаполнено(ВидЗаказа) Тогда
		Возврат Справочники.СостоянияЗаказовПокупателей.ПустаяСсылка();
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПорядокСостояний.Состояние КАК Состояние,
		|	ПорядокСостояний.Состояние.Наименование КАК Наименование,
		|	ПорядокСостояний.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Справочник.ВидыЗаказовПокупателей.ПорядокСостояний КАК ПорядокСостояний
		|ГДЕ
		|	ПорядокСостояний.Ссылка = &ВидЗаказа
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки УБЫВ";
	Запрос.УстановитьПараметр("ВидЗаказа", ВидЗаказа);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ИмяСостояния = НРег(Выборка.Наименование);
		Если СтрНайти(ИмяСостояния, "отмен") > 0 Тогда
			Возврат Выборка.Состояние;
		КонецЕсли;
	КонецЦикла;

	Возврат Справочники.СостоянияЗаказовПокупателей.ПустаяСсылка();

КонецФункции

Функция ДатаОкончанияРезерваИсточника(Источник)

	СрокХранения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник, "СрокХраненияРезерва");
	Если Не ЗначениеЗаполнено(СрокХранения) Тогда
		Возврат Дата(1, 1, 1);
	КонецЕсли;

	Возврат ТекущаяДатаСеанса() + СрокХранения * 86400;

КонецФункции

Процедура СнятьРезервЗаказа(ЗаказПокупателя)

	ДокументОбъект = ЗаказПокупателя.ПолучитьОбъект();
	Если ДокументОбъект = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Для Каждого СтрокаЗапасы Из ДокументОбъект.Запасы Цикл
		СтрокаЗапасы.Резерв = 0;
	КонецЦикла;

	Если ДокументОбъект.Проведен Тогда
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		ДокументОбъект.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура УдалитьЗаписьОчередиСтатусов(ЗаказПокупателя)

	Набор = РегистрыСведений.эв_ОчередьОтправкиСтатусовЗаказов.СоздатьНаборЗаписей();
	Набор.Отбор.ЗаказПокупателя.Установить(ЗаказПокупателя);
	Набор.Записать();

КонецПроцедуры

Процедура ОбновитьОшибкуОчередиСтатусов(ЗаказПокупателя, Источник, СтатусЗаказа, ДатаОкончанияРезерва, КоличествоПопыток, ТекстОшибки)

	МенеджерЗаписи = РегистрыСведений.эв_ОчередьОтправкиСтатусовЗаказов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ЗаказПокупателя = ЗаказПокупателя;
	МенеджерЗаписи.ИсточникЗаказов = Источник;
	МенеджерЗаписи.СтатусЗаказа = СтатусЗаказа;
	МенеджерЗаписи.СтатусОтправки = Перечисления.эв_ВидыСтатусовОчередиЗаказов.Ошибка;
	МенеджерЗаписи.КоличествоПопыток = КоличествоПопыток;
	МенеджерЗаписи.ТекстОшибки = ТекстОшибки;
	МенеджерЗаписи.Дата = ТекущаяДатаСеанса();
	МенеджерЗаписи.ДатаОкончанияРезерва = ДатаОкончанияРезерва;
	МенеджерЗаписи.Записать();

КонецПроцедуры

Процедура ЗаписатьИсториюСтатуса(ЗаказПокупателя, СтатусЗаказа, ДатаОкончанияРезерва)

	МенеджерЗаписи = РегистрыСведений.эв_ИсторияСтатусовЗаказов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	МенеджерЗаписи.ЗаказПокупателя = ЗаказПокупателя;
	МенеджерЗаписи.СтатусЗаказа = СтатусЗаказа;
	МенеджерЗаписи.ДатаОкончанияРезерва = ДатаОкончанияРезерва;
	МенеджерЗаписи.Записать();

КонецПроцедуры

Процедура ЗаписатьОшибкуОбмена(Источник, Контекст, ТекстОшибки)

	ЗаписьЖурналаРегистрации("Обмен с порталами", УровеньЖурналаРегистрации.Ошибка, , Источник,
		СтрШаблон("%1: %2", Контекст, ТекстОшибки));

КонецПроцедуры

Функция ЗначениеСвойства(Структура, ИмяСвойства, ЗначениеПоУмолчанию = Неопределено)

	Если ТипЗнч(Структура) <> Тип("Структура") Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	Если Не Структура.Свойство(ИмяСвойства) Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	Если Структура[ИмяСвойства] = Неопределено Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	Возврат Структура[ИмяСвойства];

КонецФункции

#КонецОбласти
